RU/Files/day_2_Ext/ggiExamples/turboPassageRotating/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       28100;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       28300;
    }
    fixedWalls
    {
        type            wall;
        nFaces          1400;
        startFace       28500;
    }
    movingwalls
    {
        type            patch;
        nFaces          1400;
        startFace       29900;
    }
    rotor_cyclic_upper
    {
        type            cyclicGgi;
        nFaces          50;
        startFace       31300;
        shadowPatch     rotor_cyclic_lower;
        zone            rotor_cyclic_upper_faces;
        bridgeOverlap   false;
        rotationAxis    (0 0 1);
        rotationAngle   -30;
        separationOffset (0 0 0);
    }
    rotor_cyclic_lower
    {
        type            cyclicGgi;
        nFaces          50;
        startFace       31350;
        shadowPatch     rotor_cyclic_upper;
        zone            rotor_cyclic_lower_faces;
        bridgeOverlap   false;
        rotationAxis    (0 0 1);
        rotationAngle   30;
        separationOffset (0 0 0);
    }
    stator_cyclics
    {
        type            cyclic;
        nFaces          100;
        startFace       31400;
        featureCos      0.9;
    }
    interface1
    {
        type            overlapGgi;
        nFaces          200;
        startFace       31500;
        rotationAxis    (0 0 1);
        nCopies         12;
        shadowPatch     interface2;
        zone            interface1_faces;
    }
    interface2
    {
        type            overlapGgi;
        nFaces          200;
        startFace       31700;
        rotationAxis    (0 0 1);
        nCopies         12;
        shadowPatch     interface1;
        zone            interface2_faces;
    }
)

// ************************************************************************* //
